### Imports

In [11]:
from sqlalchemy import create_engine
from sqlalchemy import inspect

from sqlalchemy import MetaData
from sqlalchemy import Table
import pandas as pd
import pprint as pp

In [2]:
cnx = create_engine('postgresql://swami:freebird293@3.17.156.114:5432/ds2')

In [6]:
inspect(cnx).get_table_names()

['inventory',
 'orders',
 'cust_hist',
 'products',
 'categories',
 'reorder',
 'customers',
 'orderlines']

In [13]:
# Create a MetaData instance
metadata = MetaData()
print(metadata.tables)

# reflect db schema to MetaData
metadata.reflect(bind=cnx)
pp.pprint(metadata.tables)

immutabledict({})
{'categories': Table('categories', MetaData(bind=None), Column('category', INTEGER(), table=<categories>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x11a57ca58>, for_update=False)), Column('categoryname', VARCHAR(length=50), table=<categories>, nullable=False), schema=None),
 'cust_hist': Table('cust_hist', MetaData(bind=None), Column('customerid', INTEGER(), ForeignKey('customers.customerid'), table=<cust_hist>, nullable=False), Column('orderid', INTEGER(), table=<cust_hist>, nullable=False), Column('prod_id', INTEGER(), table=<cust_hist>, nullable=False), schema=None),
 'customers': Table('customers', MetaData(bind=None), Column('customerid', INTEGER(), table=<customers>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x11a57c470>, for_update=False)), Column('firstname', VARCHAR(length=50), table=<customers>, nullable=False), Column('lastname', VARCHAR(length=50), table=<customers>, nullable=False), Column('address1', VARCHAR(length=50), table=<customers>, nullable=False), Column('address2', VARCHAR(length=50), table=<customers>), Column('city', VARCHAR(length=50), table=<customers>, nullable=False), Column('state', VARCHAR(length=50), table=<customers>), Column('zip', VARCHAR(length=9), table=<customers>), Column('country', VARCHAR(length=50), table=<customers>, nullable=False), Column('region', SMALLINT(), table=<customers>, nullable=False), Column('email', VARCHAR(length=50), table=<customers>), Column('phone', VARCHAR(length=50), table=<customers>), Column('creditcardtype', INTEGER(), table=<customers>, nullable=False), Column('creditcard', VARCHAR(length=50), table=<customers>, nullable=False), Column('creditcardexpiration', VARCHAR(length=50), table=<customers>, nullable=False), Column('username', VARCHAR(length=50), table=<customers>, nullable=False), Column('password', VARCHAR(length=50), table=<customers>, nullable=False), Column('age', SMALLINT(), table=<customers>), Column('income', INTEGER(), table=<customers>), Column('gender', VARCHAR(length=1), table=<customers>), schema=None),
 'inventory': Table('inventory', MetaData(bind=None), Column('prod_id', INTEGER(), table=<inventory>, primary_key=True, nullable=False), Column('quan_in_stock', INTEGER(), table=<inventory>, nullable=False), Column('sales', INTEGER(), table=<inventory>, nullable=False), schema=None),
 'orderlines': Table('orderlines', MetaData(bind=None), Column('orderlineid', SMALLINT(), table=<orderlines>, nullable=False), Column('orderid', INTEGER(), ForeignKey('orders.orderid'), table=<orderlines>, nullable=False), Column('prod_id', INTEGER(), table=<orderlines>, nullable=False), Column('quantity', SMALLINT(), table=<orderlines>, nullable=False), Column('orderdate', DATE(), table=<orderlines>, nullable=False), schema=None),
 'orders': Table('orders', MetaData(bind=None), Column('orderid', INTEGER(), table=<orders>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x11a5832e8>, for_update=False)), Column('orderdate', DATE(), table=<orders>, nullable=False), Column('customerid', INTEGER(), ForeignKey('customers.customerid'), table=<orders>), Column('netamount', NUMERIC(), table=<orders>, nullable=False), Column('tax', NUMERIC(), table=<orders>, nullable=False), Column('totalamount', NUMERIC(), table=<orders>, nullable=False), schema=None),
 'products': Table('products', MetaData(bind=None), Column('prod_id', INTEGER(), table=<products>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x11a599b38>, for_update=False)), Column('category', SMALLINT(), table=<products>, nullable=False), Column('title', TEXT(), table=<products>, nullable=False), Column('actor', TEXT(), table=<products>, nullable=False), Column('price', NUMERIC(), table=<products>, nullable=False), Column('special', SMALLINT(), table=<products>), Column('common_prod_id', INTEGER(), table=<products>, nullable=False), schema=None),
 'reorder': Table('reorder', MetaData(bind=None), Column('prod_id', INTEGER(), table=<reorder>, nullable=False), Column('date_low', DATE(), table=<reorder>, nullable=False), Column('quan_low', INTEGER(), table=<reorder>, nullable=False), Column('date_reordered', DATE(), table=<reorder>), Column('quan_reordered', INTEGER(), table=<reorder>), Column('date_expected', DATE(), table=<reorder>), schema=None)}

In [3]:
pd.read_sql_query('''SELECT orders.orderid, 
      orders.orderdate, 
      orders.customerid, 
      orders.totalamount,
      customers.city, 
      customers.state, 
      customers.country, 
      customers.age,
      customers.income, 
      customers.gender       
FROM orders
JOIN customers
ON orders.customerid = customers.customerid
LIMIT 5''', cnx)

,orderid,orderdate,customerid,totalamount,city,state,country,age,income,gender
0,4695,2009-05-11,3,421.15,LWVIFXJ,OH,US,47,100000,M
1,11021,2009-12-15,4,139.13,HOKEXCD,MS,US,44,40000,F
2,3446,2009-04-30,8,297.42,BKSRQJE,NJ,US,67,80000,F
3,6706,2009-07-27,8,70.89,BKSRQJE,NJ,US,67,80000,F
4,2823,2009-03-06,11,428.19,ICLYPGR,PA,US,58,60000,M

### Part 1

The SQL code to create the report.

In [ ]:
1. CREATE TABLE order_cust AS
SELECT orders.orderid, 
      orders.orderdate, 
      orders.customerid, 
      orders.totalamount,
      customers.city, 
      customers.state, 
      customers.country, 
      customers.age,
      customers.income, 
      customers.gender       
FROM orders
JOIN customers
ON orders.customerid = customers.customerid;


2. CREATE VIEW order_quant AS
SELECT orderid, 
       COUNT(quantity) AS order_quantity        
       FROM orderlines 
       GROUP BY orderid;

3. CREATE VIEW first_merge AS
SELECT order_cust.orderid, 
      order_cust.orderdate, 
      order_cust.customerid, 
      order_cust.totalamount,
      order_cust.city, 
      order_cust.state, 
      order_cust.country, 
      order_cust.age,
      order_cust.income, 
      order_cust.gender, 
      order_quant.order_quantity
FROM order_cust
JOIN order_quant
ON order_cust.orderid = order_quant.orderid;


4. CREATE VIEW quantity_table AS
SELECT customerid, 
       COUNT(orderid) AS order_count, 
       SUM(pre_ord_price_table.amount) as total_amount 
         FROM (SELECT cust_hist.orderid, 
                                      cust_hist.customerid, 
                                      cust_hist.prod_id, 
                                      products.price,
                                      orderlines.quantity,
                                      (products.price*orderlines.quantity) AS amount
                       FROM cust_hist
                       JOIN products
                       ON cust_hist.prod_id = products.prod_id
                       JOIN orderlines
                       ON cust_hist.orderid = orderlines.orderid
                       AND cust_hist.prod_id = orderlines.prod_id) AS pre_ord_price_table
         GROUP BY customerid;
        
        
5. CREATE VIEW second_merge AS
SELECT first_merge.orderid, 
      first_merge.orderdate, 
      first_merge.customerid, 
      first_merge.totalamount,
      first_merge.city, 
      first_merge.state, 
      first_merge.country, 
      first_merge.age,
      first_merge.income, 
      first_merge.gender, 
      first_merge.order_quantity,
      quantity_table.order_count AS previous_order_count,
      quantity_table.total_amount AS total_amount_prev_ord
FROM first_merge
LEFT JOIN quantity_table
ON first_merge.customerid = quantity_table.customerid
ORDER BY 3;

6. CREATE OR ALTER VIEW table_one AS
SELECT *,
CASE WHEN second_merge.customerid IN (SELECT customerid FROM cust_hist) THEN 'existing'
ELSE 'new'
END as customer_type
FROM second_merge
ORDER BY orderid;

7. CREATE VIEW prod_inv AS
SELECT subtract.prod_id, 
    subtract.orderid, 
    subtract.quantity, 
    subtract.orderdate, 
    subtract.quan_in_stock,
    SUM(subtract.quantity) OVER (PARTITION BY prod_id  ROWS UNBOUNDED PRECEDING) AS sum_orders
    FROM
(SELECT order_stock.prod_id,
    order_stock.orderid,
    order_stock.quantity,
    order_stock.orderdate,
    order_stock.quan_in_stock
FROM (SELECT orderlines.prod_id,
    orderlines.orderid,
    orderlines.quantity,
    orderlines.orderdate,
    inventory.quan_in_stock
    FROM orderlines
    JOIN inventory
    ON orderlines.prod_id = inventory.prod_id
    ORDER BY 1, 4 ASC) AS order_stock) AS subtract;


8. CREATE VIEW order_status_report AS
SELECT orderid, sum,
CASE
WHEN sum = 0 THEN 'fulfilled'
WHEN sum % 100 = 0 THEN 'backordered'
ELSE 'partial'
END AS status
FROM
(SELECT orderid, SUM(order_status)
FROM
(SELECT orderid, 
       prod_id,
       CASE 
    WHEN (quan_in_stock - sum_orders) > quantity THEN 0
    WHEN (quan_in_stock - sum_orders) < quantity THEN 1
    ELSE 100
    END AS order_status
    FROM prod_inv) AS status_update
GROUP BY orderid) AS status_symbol;

9. CREATE VIEW table_final AS
SELECT table_one.orderid,
       table_one.orderdate,
       table_one.customerid,
       table_one.totalamount,
       table_one.city,
       table_one.state,
       table_one.country,
       table_one.age,
       table_one.income,
       table_one.gender,
       table_one.order_quantity,
       table_one.previous_order_count,
       table_one.total_amount_prev_ord,
       table_one.customer_type,
       order_status_report.status
FROM table_one
JOIN order_status_report
ON table_one.orderid = order_status_report.orderid
ORDER BY orderid;

In [ ]:
 orderid | orderdate  | customerid | totalamount |  city   | state | country | age | income | gender | order_quantity | previous_order_count | total_amount_prev_ord | customer_type |  status   
---------+------------+------------+-------------+---------+-------+---------+-----+--------+--------+----------------+----------------------+-----------------------+---------------+-----------
       1 | 2009-11-12 |    1566199 |      345.73 | JIJUOKC |       | China   |  58 |  60000 | M      |              9 |                    9 |                324.85 | existing      | partial
       2 | 2009-01-25 |     313359 |      173.61 | XIQAQYK | UT    | US      |  61 |  20000 | F      |              2 |                    2 |                 94.95 | existing      | fulfilled
       3 | 2009-01-27 |    1225280 |      128.19 | AYLEIQI |       | UK      |  87 |  60000 | M      |              6 |                    6 |                189.89 | existing      | fulfilled
       4 | 2009-01-29 |     139511 |      411.07 | UAZPITF | OK    | US      |  30 |  80000 | F      |              5 |                   10 |                354.82 | existing      | fulfilled
       5 | 2009-01-31 |    1804417 |      368.45 | ZIMPBDD |       | China   |  34 | 100000 | M      |              3 |                    5 |                110.92 | existing      | fulfilled
(5 rows)

### Part 2.

#### a: 

What percent of the sales come from new vs. existing customers?

In [ ]:
SELECT customer_type, 
       (SUM(totalamount) * 100 / (SELECT SUM(totalamount) FROM table_final)) as Percentage
FROM table_final
GROUP BY customer_type;

In [ ]:
NO NEW CUSTOMERS!

#### b

What percent of orders were fulfilled (partial, full, backorder)?

In [ ]:
SELECT status, 
       (SUM(order_quantity) * 100 / (SELECT SUM(order_quantity) FROM table_final)) as Percentage
FROM table_final
GROUP BY status;

In [ ]:
DID NOT WORK. TEST CODE INSERTED

#### c

What is the distribution of sales by category?

This is not possible to answer as the the category column was not available in the final report. Each category is associated with a product, while each order is comprised of multiple products. Therefore, it will not be possible for us to aggregate both categories and titles into each order ID (which is how the final tables are aggregated).

#### d

What is the monthly revenue and what is the cumulative revenue as of each month within a year (cumulative revenue resets at the beginning of each year)?

In [ ]:
SELECT txn_year, 
       txn_month, 
       monthly_sales,
       SUM(monthly_sales) OVER (PARTITION BY txn_year ROWS UNBOUNDED PRECEDING) AS cumulative
    FROM (SELECT date_trunc('year', orderdate) AS txn_year, 
                 date_trunc('month', orderdate) AS txn_month,
                 SUM(totalamount) as monthly_sales
FROM table_final
GROUP BY 1,2
ORDER BY 1,2) sales

The query below is a proxy for the code above. Since I could get the report to build on AWS machine, I ran an alternative to get at the similar cumulative and monthly numbers. The query and results are shown below.

In [162]:
pd.read_sql_query('''SELECT txn_year, txn_month, monthly_sales,
                            SUM(monthly_sales) OVER (PARTITION BY txn_year ROWS UNBOUNDED PRECEDING) AS cumulative
                            FROM (SELECT date_trunc('year', orderdate) AS txn_year, 
                            date_trunc('month', orderdate) AS txn_month,
                            SUM(totalamount) as monthly_sales
                    FROM (SELECT orders.orderid, 
      orders.orderdate, 
      orders.customerid, 
      orders.totalamount,
      customers.city, 
      customers.state, 
      customers.country, 
      customers.age,
      customers.income, 
      customers.gender       
FROM orders
JOIN customers
ON orders.customerid = customers.customerid) AS orders_table
GROUP BY 1,2
ORDER BY 1,2) sales''', cnx)

,txn_year,txn_month,monthly_sales,cumulative
0,2009-01-01 00:00:00+00:00,2009-01-01 00:00:00+00:00,21718018.48,2.171802e+07
1,2009-01-01 00:00:00+00:00,2009-02-01 00:00:00+00:00,21640456.98,4.335848e+07
2,2009-01-01 00:00:00+00:00,2009-03-01 00:00:00+00:00,21647124.14,6.500560e+07
3,2009-01-01 00:00:00+00:00,2009-04-01 00:00:00+00:00,21627496.06,8.663310e+07
4,2009-01-01 00:00:00+00:00,2009-05-01 00:00:00+00:00,21648654.49,1.082818e+08
5,2009-01-01 00:00:00+00:00,2009-06-01 00:00:00+00:00,21634753.24,1.299165e+08
6,2009-01-01 00:00:00+00:00,2009-07-01 00:00:00+00:00,21623664.77,1.515402e+08
7,2009-01-01 00:00:00+00:00,2009-08-01 00:00:00+00:00,21584849.84,1.731250e+08
8,2009-01-01 00:00:00+00:00,2009-09-01 00:00:00+00:00,21649469.42,1.947745e+08
9,2009-01-01 00:00:00+00:00,2009-10-01 00:00:00+00:00,21629894.03,2.164044e+08
10,2009-01-01 00:00:00+00:00,2009-11-01 00:00:00+00:00,21686732.18,2.380911e+08
11,2009-01-01 00:00:00+00:00,2009-12-01 00:00:00+00:00,21702614.37,2.597937e+08

#### e

What is the distribution of sales by customer age buckets?

See last query for template.

### TESTING

In [140]:
simple_join = pd.read_sql_query('''SELECT orders.orderid, 
      orders.orderdate, 
      orders.customerid, 
      orders.totalamount,
      customers.city, 
      customers.state, 
      customers.country, 
      customers.age,
      customers.income, 
      customers.gender       
FROM orders
JOIN customers
ON orders.customerid = customers.customerid
LIMIT 5''', cnx)

In [141]:
simple_join

,orderid,orderdate,customerid,totalamount,city,state,country,age,income,gender
0,73,2009-01-14,687041,21.86,MHKKDNF,CA,US,39,80000,M
1,122,2009-01-14,1485246,366.38,HCVTEUL,,Germany,85,40000,M
2,130,2009-01-10,923412,132.04,UZXKLFQ,IN,US,70,80000,F
3,168,2009-01-11,118596,313.43,NWECRFU,MS,US,19,20000,M
4,203,2009-01-02,619922,283.10,MGHQEXJ,NV,US,40,80000,F
5,312,2009-01-29,235339,40.53,TGLOBQR,CA,US,55,80000,F
6,370,2009-01-26,1834787,51.06,RYEDGEU,,South Africa,47,80000,M
7,381,2009-01-12,505939,319.63,QBQGDDB,GA,US,47,20000,F
8,507,2009-01-15,1728894,102.17,GCRKTMY,,Canada,34,80000,F
9,528,2009-01-19,731505,312.82,KGOLJKC,CT,US,24,60000,F
10,586,2009-01-28,391051,41.26,WVEAETL,MT,US,86,60000,F
11,624,2009-01-21,1507787,18.26,OSZMFXV,,Japan,32,40000,F
12,685,2009-01-08,1701999,5.33,RIZYXNF,,Australia,56,100000,M
13,743,2009-01-22,772742,220.86,CNFPTJA,MI,US,74,60000,F
14,751,2009-01-06,1720270,230.33,NBQGAXX,,France,21,60000,M
15,1000,2009-01-18,1206082,135.23,GICDRHC,,France,69,40000,M
16,1010,2009-01-17,928987,327.38,WXDIVMZ,IL,US,82,20000,M
17,1180,2009-01-26,1278361,76.24,IVEFCSP,,Canada,23,60000,M
18,1246,2009-01-16,1242499,310.69,FIPRZAN,,Australia,52,60000,M
19,1415,2009-01-30,923308,335.49,FWTUYCN,KS,US,68,40000,F
20,1422,2009-01-03,1174096,355.18,IBRVXIF,,Canada,67,60000,F
21,1480,2009-01-29,294246,142.91,YHZWDAF,GA,US,31,40000,F
22,1518,2009-01-12,616851,356.20,AATOLMR,UT,US,49,60000,F
23,1576,2009-01-29,947146,47.18,FEDSGMU,WA,US,50,100000,M
24,1587,2009-01-20,719915,300.04,UMQNMBO,CO,US,48,60000,M
25,1657,2009-01-22,615577,75.66,UKEKGZH,OH,US,89,80000,M
26,1678,2009-01-22,1173541,312.41,UBDWOEM,,Russia,83,40000,M
27,2093,2009-01-26,1194155,178.96,TFGXGQV,,South Africa,24,100000,F
28,2144,2009-01-20,719951,396.62,OYJZBRP,SD,US,55,20000,M
29,2195,2009-01-30,737248,249.87,VOJFIQL,KS,US,31,40000,F
...,...,...,...,...,...,...,...,...,...,...
1199970,1198589,2009-12-09,1102100,244.19,DMYPZSJ,,China,31,40000,F
1199971,1198601,2009-12-28,816971,386.72,GXHQTKK,WI,US,54,40000,M
1199972,1198790,2009-12-07,1654490,89.41,UGMFASZ,,South Africa,47,40000,F
1199973,1198819,2009-12-02,600965,30.02,RZLRSSE,AZ,US,61,80000,M
1199974,1198859,2009-12-07,266911,0.99,RNNEUCM,MT,US,67,80000,M
1199975,1198983,2009-12-17,1466429,91.29,PRJHZVB,,Canada,68,100000,F
1199976,1198991,2009-12-01,1410802,353.82,VAEKPSG,,China,24,40000,M
1199977,1199004,2009-12-06,1311105,303.41,APEHJKY,,Germany,75,20000,M
1199978,1199016,2009-12-18,1929048,366.07,LZPOYKL,,Australia,70,40000,F
1199979,1199080,2009-12-30,1445900,266.13,QVBOLRP,,Chile,89,60000,M
1199980,1199091,2009-12-27,706205,169.77,HOHXKYG,SD,US,83,40000,F
1199981,1199111,2009-12-22,367158,212.70,YDXJKBS,DE,US,81,20000,M
1199982,1199119,2009-12-13,473552,118.84,FHYGZKW,KS,US,22,60000,F
1199983,1199162,2009-12-25,1193495,413.30,AJDIPTF,,South Africa,78,100000,M
1199984,1199177,2009-12-11,637786,273.39,NMMEPCK,OR,US,50,60000,F
1199985,1199305,2009-12-22,1726753,384.01,RCCEZQZ,,Japan,35,60000,F
1199986,1199403,2009-12-12,1601206,237.04,CUFFXKS,,Germany,77,60000,M
1199987,1199415,2009-12-01,1914204,193.93,GOOUNBV,,UK,89,20000,F
1199988,1199420,2009-12-08,477431,376.87,BVNQYAR,FL,US,20,20000,F
1199989,1199495,2009-12-28,4259,379.67,FDZOQYZ,IL,US,25,20000,F
1199990,1199529,2009-12-28,1375837,74.04,WGWKIBT,,Germany,71,40000,F
1199991,1199548,2009-12-16,69365,336.77,UREUMCT,KY,US,21,60000,F
1199992,1199581,2009-12-19,1750874,284.77,TWQYXCQ,,Chile,59,80000,M
1199993,1199600,2009-12-04,1975694,1.43,MKIJDRE,,Russia,65,60000,F
1199994,1199735,2009-12-14,192260,338.93,UHLEGVC,TX,US,85,20000,M
1199995,1199804,2009-12-22,1820681,114.58,COFCFBE,,France,48,60000,M
1199996,1199853,2009-12-13,42826,55.35,CCXPNCO,HI,US,43,20000,M
1199997,1199941,2009-12-30,719457,40.62,ESMUWHR,LA,US,59,20000,M
1199998,1199976,2009-12-16,49375,154.12,TXZEJZH,VA,US,29,20000,F
1199999,1199991,2009-12-08,48873,309.11,QWNBHPQ,MA,US,39,100000,F

In [118]:
product_table = pd.read_sql_query('''SELECT products.prod_id,
                                            products.category,
                                            products.price,
                                            inventory.quan_in_stock,
                                            inventory.sales        
                                   FROM products 
                                   JOIN inventory
                                   ON products.prod_id = inventory.prod_id
                                   LIMIT 5''', cnx)

In [119]:
product_table

   prod_id  category  price  quan_in_stock  sales
0        1        14  25.99            225    130
1        2         6  20.99            275    130
2        3         6  28.99            133    122
3        4         3  14.99            144    126
4        5         3  11.99            177    137

In [120]:
pd.read_sql_query('''SELECT * FROM cust_hist LIMIT 5''', cnx)

   customerid  orderid  prod_id
0     1566199        1    19756
1     1566199        1    76823
2     1566199        1    55397
3     1566199        1    62888
4     1566199        1    51341

In [121]:
order_quant = pd.read_sql_query('''SELECT orderid, COUNT(quantity) AS order_quantity        
                                   FROM orderlines 
                                   GROUP BY orderid
                                   LIMIT 5''', cnx)

In [122]:
order_quant

   orderid  order_quantity
0        1               9
1        2               2
2        3               6
3        4               5
4        5               3

NOT TO USE. IS ALREADY A PART OF THE SQL QUERY BELOW

In [123]:
pre_ord_price_table = pd.read_sql_query('''SELECT cust_hist.orderid, 
                                                  cust_hist.customerid, 
                                                  cust_hist.prod_id, 
                                                  products.price,
                                                  orderlines.quantity,
                                                  (products.price*orderlines.quantity) AS amount
                                   FROM cust_hist
                                   JOIN products
                                   ON cust_hist.prod_id = products.prod_id
                                   JOIN orderlines
                                   ON cust_hist.orderid = orderlines.orderid
                                   AND cust_hist.prod_id = orderlines.prod_id
                                   LIMIT 5''', cnx)

In [124]:
pre_ord_price_table

   orderid  customerid  prod_id  price  quantity  amount
0        1     1566199    19756  21.99         2   43.98
1        1     1566199    76823  26.99         1   26.99
2        1     1566199    55397  24.99         2   49.98
3        1     1566199    62888  16.99         2   33.98
4        1     1566199    51341  26.99         3   80.97

In [125]:
quantity_table = pd.read_sql_query('''SELECT customerid, 
                                             COUNT(orderid) AS order_count, 
                                             SUM(pre_ord_price_table.amount) as total_amount 
                     FROM (SELECT cust_hist.orderid, 
                                                  cust_hist.customerid, 
                                                  cust_hist.prod_id, 
                                                  products.price,
                                                  orderlines.quantity,
                                                  (products.price*orderlines.quantity) AS amount
                                   FROM cust_hist
                                   JOIN products
                                   ON cust_hist.prod_id = products.prod_id
                                   JOIN orderlines
                                   ON cust_hist.orderid = orderlines.orderid
                                   AND cust_hist.prod_id = orderlines.prod_id) AS pre_ord_price_table
                     GROUP BY customerid
                     LIMIT 5''', cnx)

In [126]:
quantity_table

   customerid  order_count  total_amount
0           1            6        218.88
1           2            4        108.93
2           3           12        417.78
3           5           14        477.73
4           6            2         97.96

In [136]:
pd.read_sql_query('''SELECT subtract.prod_id, 
                            subtract.orderid, 
                            subtract.quantity, 
                            subtract.orderdate, 
                            subtract.quan_in_stock,
                            SUM(subtract.quantity) OVER (PARTITION BY prod_id  ROWS UNBOUNDED PRECEDING) AS sum_orders
                            
                            FROM
                    (SELECT order_stock.prod_id,
                            order_stock.orderid,
                            order_stock.quantity,
                            order_stock.orderdate,
                            order_stock.quan_in_stock
                     FROM (SELECT orderlines.prod_id,
                            orderlines.orderid,
                            orderlines.quantity,
                            orderlines.orderdate,
                            inventory.quan_in_stock
                            FROM orderlines
                            JOIN inventory
                            ON orderlines.prod_id = inventory.prod_id
                            ORDER BY 1, 4 ASC) AS order_stock) AS subtract
                            LIMIT 100''', cnx)

    prod_id  orderid  quantity   orderdate  quan_in_stock  sum_orders
0         1    38411         3  2009-01-01            225           3
1         1    83465         2  2009-01-18            225           5
2         1    13582         3  2009-01-20            225           8
3         1    79608         2  2009-01-23            225          10
4         1     2588         2  2009-01-27            225          12
5         1   177742         3  2009-02-09            225          15
6         1   172788         1  2009-02-13            225          16
7         1   151146         1  2009-02-17            225          17
8         1   148521         1  2009-02-21            225          18
9         1   267079         2  2009-03-05            225          20
10        1   256230         1  2009-03-20            225          21
11        1   285290         2  2009-03-21            225          23
12        1   240801         1  2009-03-23            225          24
13        1   266514         3  2009-03-30            225          27
14        1   322275         2  2009-04-03            225          29
15        1   393290         2  2009-04-06            225          31
16        1   395887         2  2009-04-11            225          33
17        1   371891         2  2009-04-17            225          35
18        1   365536         1  2009-04-20            225          36
19        1   333970         3  2009-04-23            225          39
20        1   390164         3  2009-04-25            225          42
21        1   497553         1  2009-05-01            225          43
22        1   467239         3  2009-05-08            225          46
23        1   433835         2  2009-05-09            225          48
24        1   471571         1  2009-05-12            225          49
25        1   454749         2  2009-05-19            225          51
26        1   479430         1  2009-05-20            225          52
27        1   571210         2  2009-06-01            225          54
28        1   562168         3  2009-06-03            225          57
29        1   515401         1  2009-06-22            225          58
..      ...      ...       ...         ...            ...         ...
70        2   112054         3  2009-02-22            275          16
71        2   270765         3  2009-03-03            275          19
72        2   225483         1  2009-03-08            275          20
73        2   243891         1  2009-03-21            275          21
74        2   268448         1  2009-03-23            275          22
75        2   316104         2  2009-04-01            275          24
76        2   363970         3  2009-04-06            275          27
77        2   318132         1  2009-04-08            275          28
78        2   304736         1  2009-04-21            275          29
79        2   395124         1  2009-04-23            275          30
80        2   328977         1  2009-04-27            275          31
81        2   421129         1  2009-05-01            275          32
82        2   454664         1  2009-05-06            275          33
83        2   457656         3  2009-05-10            275          36
84        2   404868         3  2009-05-12            275          39
85        2   482326         2  2009-05-16            275          41
86        2   479001         1  2009-05-26            275          42
87        2   471435         3  2009-05-29            275          45
88        2   539406         1  2009-06-01            275          46
89        2   525794         3  2009-06-13            275          49
90        2   535634         2  2009-06-24            275          51
91        2   549834         3  2009-06-27            275          54
92        2   548577         2  2009-06-27            275          56
93        2   522637         2  2009-06-29            275          58
94        2   573496         2  2009-06-29            275          60
95        2   621583         2  2009-07-13            275          62
96        2   629144         3  2009-07-17            275          65
97        2   641340         2  2009-07-19            275          67
98        2   677455         1  2009-07-31            275          68
99        2   737047         3  2009-08-07            275          71

[100 rows x 6 columns]

In [160]:
pd.read_sql_query('''SELECT txn_year, txn_month, monthly_sales,
                            SUM(monthly_sales) OVER (PARTITION BY txn_year ROWS UNBOUNDED PRECEDING) AS cumulative
                            FROM (SELECT date_trunc('year', orderdate) AS txn_year, 
                            date_trunc('month', orderdate) AS txn_month,
                            SUM(totalamount) as monthly_sales
                    FROM (SELECT orders.orderid, 
      orders.orderdate, 
      orders.customerid, 
      orders.totalamount,
      customers.city, 
      customers.state, 
      customers.country, 
      customers.age,
      customers.income, 
      customers.gender       
FROM orders
JOIN customers
ON orders.customerid = customers.customerid) AS orders_table
GROUP BY 1,2
ORDER BY 1,2) sales''', cnx)

,txn_year,txn_month,monthly_sales,cumulative
0,2009-01-01 00:00:00+00:00,2009-01-01 00:00:00+00:00,21718018.48,2.171802e+07
1,2009-01-01 00:00:00+00:00,2009-02-01 00:00:00+00:00,21640456.98,4.335848e+07
2,2009-01-01 00:00:00+00:00,2009-03-01 00:00:00+00:00,21647124.14,6.500560e+07
3,2009-01-01 00:00:00+00:00,2009-04-01 00:00:00+00:00,21627496.06,8.663310e+07
4,2009-01-01 00:00:00+00:00,2009-05-01 00:00:00+00:00,21648654.49,1.082818e+08
5,2009-01-01 00:00:00+00:00,2009-06-01 00:00:00+00:00,21634753.24,1.299165e+08
6,2009-01-01 00:00:00+00:00,2009-07-01 00:00:00+00:00,21623664.77,1.515402e+08
7,2009-01-01 00:00:00+00:00,2009-08-01 00:00:00+00:00,21584849.84,1.731250e+08
8,2009-01-01 00:00:00+00:00,2009-09-01 00:00:00+00:00,21649469.42,1.947745e+08
9,2009-01-01 00:00:00+00:00,2009-10-01 00:00:00+00:00,21629894.03,2.164044e+08
10,2009-01-01 00:00:00+00:00,2009-11-01 00:00:00+00:00,21686732.18,2.380911e+08
11,2009-01-01 00:00:00+00:00,2009-12-01 00:00:00+00:00,21702614.37,2.597937e+08

In [170]:
pd.read_sql_query('''SELECT age_floor,
                     CONCAT(age_floor, 'to', age_ceiling) as age_category,
                     SUM(totalamount) as sales
                    FROM (SELECT FLOOR(age/10.0)*10 as age_floor,
                                 FLOOR(age/10.0)*10 +10 as age_ceiling
                                 FROM(SELECT order_cust.orderid, 
      order_cust.orderdate, 
      order_cust.customerid, 
      order_cust.totalamount,
      order_cust.city, 
      order_cust.state, 
      order_cust.country, 
      order_cust.age,
      order_cust.income, 
      order_cust.gender, 
      order_quant.order_quantity
FROM order_cust
JOIN order_quant
ON order_cust.orderid = order_quant.orderid) AS orders_table
GROUP BY 1,2
ORDER BY 1,2) sales
GROUP BY 1, 2
ORDER BY 1 ''', cnx)

ProgrammingError: (psycopg2.ProgrammingError) column "totalamount" does not exist
LINE 3:                      SUM(totalamount) as sales
                                 ^
 [SQL: "SELECT age_floor,\n                     CONCAT(age_floor, 'to', age_ceiling) as age_category,\n                     SUM(totalamount) as sales\n                    FROM (SELECT FLOOR(age/10.0)*10 as age_floor,\n                                 FLOOR(age/10.0)*10 +10 as age_ceiling\n                                 FROM(SELECT order_cust.orderid, \n      order_cust.orderdate, \n      order_cust.customerid, \n      order_cust.totalamount,\n      order_cust.city, \n      order_cust.state, \n      order_cust.country, \n      order_cust.age,\n      order_cust.income, \n      order_cust.gender, \n      order_quant.order_quantity\nFROM order_cust\nJOIN order_quant\nON order_cust.orderid = order_quant.orderid) AS orders_table\nGROUP BY 1,2\nORDER BY 1,2) sales\nGROUP BY 1, 2\nORDER BY 1 "] (Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
select
    bucket_floor,
    CONCAT(bucket_floor, ' to ', bucket_ceiling) as bucket_name,
    count(*) as count
from (
	select 
		floor(revenue/5.00)*5 as bucket_floor,
		floor(revenue/5.00)*5 + 5 as bucket_ceiling
	from web_sessions_table
) a
group by 1, 2
order by 1;
view raw